<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta content="text/html; charset=ISO-8859-1"
 http-equiv="content-type">
  <title>Mobython</title>
</head>
<body>
<h1>Mobython : grille de calcul sur t&eacute;l&eacute;phones portables<br>
</h1>
<h2>Contexte</h2>
Cr&eacute;&eacute;e &agrave; l&#8217;initiative de la <a
 href="http://www.mdausa.org">Muscular Dystrophy Association</a>1 en
1966, et pr&eacute;sent&eacute;e depuis l&#8217;origine par Jerry Lewis, le
T&eacute;l&eacute;thon a pour but de collecter des fonds pour la
recherche sur les maladies musculaires. Devant le franc succ&egrave;s
de ce qui est devenu depuis une institution aux &Eacute;tats-Unis, des
associations ont organis&eacute; des &eacute;v&eacute;nements
similaires dans de nombreux pays &agrave; travers le monde. C&#8217;est en
d&eacute;cembre 1987 que le <a href="http://www.telethon.fr">T&eacute;l&eacute;thon
fran&ccedil;ais</a> a vu le jour, fruit d&#8217;une collaboration entre
l&#8217;Association Fran&ccedil;aise contre les Myopathies, le Lions Club
Fran&ccedil;ais et France 2.<br>
Dans le m&ecirc;me temps s&#8217;est d&eacute;velopp&eacute; le projet <a
 href="http://setiathome.ssl.berkeley.edu/">Seti@Home</a>. Faisant
suite &agrave; une id&eacute;e d&eacute;velopp&eacute;e en 1959 par
Coccoin et Morrison, consistant &agrave; utiliser les p&eacute;riodes
d&#8217;inactivit&eacute;s du supercalculateur (de l&#8217;&eacute;poque !) de la
NASA afin de rechercher d&#8217;&eacute;ventuels signaux intellligents en
provenance de l&#8217;espace, Gedge et Kasnoff d&eacute;veloppent une
infrastructure permettant d&#8217;utiliser les ordinateurs volontaires
reli&eacute;s &agrave; l&#8217;Internet pour effectuer le m&ecirc;me travail.<br>
Aujourd&#8217;hui, le projet Seti@Home comptabilise plus de deux millions de
postes &agrave; travers le monde.<br>
La rencontre de ces deux initiatives en 2001 a
g&eacute;n&eacute;r&eacute; le <a href="http://www.decrypthon.fr">Decrypthon</a>,
pour lequel environ 75.000 volontaires ont mis &agrave; disposition
leur ordinateur reli&eacute; &agrave; l&#8217;Internet afin de
r&eacute;aliser une comparaison exhaustive de toutes les
prot&eacute;ines connues &agrave; cette &eacute;poque. Depuis, de
nouvelles technologies se sont d&eacute;velopp&eacute;es. En
particulier, alors que 45% de la population fran&ccedil;aise disposait
d&#8217;un ordinateur en 2004, <a
 href="http://www.insee.fr/fr/ffc/chifcle_fiche.asp%20?ref_id=NATSOS05118&amp;tab_id=431">70%
de cette m&ecirc;me population &eacute;tait &eacute;quip&eacute;e d&#8217;un<br>
t&eacute;l&eacute;phone portable</a>. Ainsi, cet essor r&eacute;cent de
la t&eacute;l&eacute;phonie mobile fait que les circonstances sont
particuli&egrave;rement favorables pour la mise en place de Mobython,
o&ugrave; les utilisateurs pourront mettre &agrave; disposition les
ressources de leur mobile afin de permettre &agrave; la recherche en
biologie de progresser.<br>
<br>
<h2>Transformation et g&eacute;n&eacute;ration de code</h2>
La cible &eacute;tant du Java pour t&eacute;l&eacute;phone portable et
les applications vis&eacute;es &eacute;tant &eacute;crites en C ou
Fortran, il s'agira dans un premier temps de cr&eacute;er une
transformation traduisant du Fortran ou du C en Java. On utilisera
l'outil de transformation de programme <a
 href="http://www.cri.ensmp.fr/pips/">PIPS</a>.<br>
Dans le cadre du projet commun avec l'INT, le CNAM, Genomining et
NetInnovation, on &eacute;tudiera le portage et la
parall&eacute;lisation manuelle d'une application de g&eacute;nomique
et dans ce stage il faudra en d&eacute;duire des techniques
g&eacute;n&eacute;ralisables &agrave; cette classe d'applications. <br>
On s'attaquera &agrave; la parall&eacute;lisation automatique des
applications ou &agrave; une parall&eacute;lisation semi-automatique
&agrave; partir de directives qu'on d&eacute;finira.<br>
Les d&eacute;veloppements dans PIPS seront effectu&eacute;s en langage
C.<br>
<h2>Contact</h2>
Ronan Keryell : <a href="http://enstb.org/%7Ekeryell">http://enstb.org/~keryell</a><br>
<br>
<hr>
<code>
$Header: /users/lit/keryell/ENST-Bretagne/3A/DEA/2005-2006/Sujets/RCS/Mobython.html,v 1.1 2005/10/10 21:47:07 keryell Exp $
</code><br>
</body>
</html>
