<!DOCTYPE HTML SYSTEM "legacy.dtd">
<html>
<head>
  <meta http-equiv="content-type"
 content="text/html; charset=ISO-8859-1">
  <title>Sujet: PCFengine - un syst&egrave;me logiciel d'administration
syst&egrave;me orient&eacute; objet</title>
</head>
<body>
<h2>
Sujet: OASIS - un syst&egrave;me logiciel d'administration
syst&egrave;me
libre orient&eacute; objet
</h2>
<p>Les ordinateurs sont utilis&eacute;s partout mais sont
paradoxalement encore
administr&eacute;s souvent comme ils l'&eacute;taient il y a 60 ans,
c'est &agrave; dire un
peu
&agrave; la mani&egrave;re de la taille du menhir avec un silex.</p>
<p>Cet aspect &eacute;chappe souvent au grand public qui ach&egrave;te
g&eacute;n&eacute;ralement
un
ordinateur avec tout install&eacute; dessus et se contente de la
configuration
par d&eacute;faut (jusqu'au jour o&ugrave; le disque dur est pas
corrompu...) mais
dans les grandes infrastructures le probl&egrave;me est tout autre :
comment
d&eacute;ployer
de mani&egrave;re efficace l'informatique de toute une &eacute;cole ou
de tout un
r&eacute;seau
de t&eacute;l&eacute;communication mais aussi de configurations
personnelles,
d'ordinateurs de t&eacute;l&eacute;travail, etc. et d'assurer ensuite
une gestion
quotidienne des probl&egrave;mes qui ne manqueront pas de survenir ?</p>
<p>Le but de ce projet est donc de simplifier l'usage de l'informatique
et
des r&eacute;seaux en automatisant totalement la phase d'installation
et en
supprimant presque tout suivi journalier des syst&egrave;mes &agrave;
la mani&egrave;re d'un
syst&egrave;me immunitaire pour ordinateur.</p>
<p>Il existe d&eacute;j&agrave; de nombreux outils d'aide &agrave;
l'administration syst&egrave;me, pour la configuration des logiciels,
des
machines, de toute une infrastructure, etc.
</p>
<p>Par exemple <a href="http://www.cfengine.org"><tt>http://www.cfengine.org</tt></a>
est un
outil tr&egrave;s int&eacute;ressant permettant de d&eacute;finir dans
un
langage d&eacute;claratif des actions &agrave; entreprendre en fonction
de
certaines conditions et dans diff&eacute;rents contextes.
Malheureusement
cet outil utilise un langage de d&eacute;claration sp&eacute;cifique, a
de
nombreuses limitations et est difficile &agrave; &eacute;tendre.
</p>
<p>Le coeur du projet OASIS (Open Administration for computer System
InfraStructure) est centr&eacute; autour d'une politique d'usage et de
d&eacute;ploiement des diff&eacute;rents syst&egrave;mes et le
d&eacute;veloppement d'un nouvel
outil
PCFengine r&eacute;alisant concr&egrave;tement toutes les t&acirc;ches
d'administration
syst&egrave;me et fonctionnant comme un syst&egrave;me immunitaire :
appliquer des
actions correctives petites et locales mais oeuvrant au bon &eacute;tat
global
du
syst&egrave;me.
</p>
<p>Pour ce faire, on propose de d&eacute;velopper dans le projet
PCFengine le
concept directement dans un langage de haut niveau orient&eacute;
objet,
&agrave; savoir le langage Python (<a href="http://www.python.org"><tt>http://www.python.org</tt></a>).
Par
certains c&ocirc;t&eacute; on va se rapprocher de certains aspects
qu'on
trouve dans le syst&egrave;me de serveur d'application <a
 href="http://www.zope.org">Zope</a> qui outre le m&eacute;canisme
classique d'h&eacute;ritage de la programmation objet rajoute un
m&eacute;canisme d'acquisition de propri&eacute;t&eacute;
d&eacute;pendant
de la position des objets.
</p>
<p>On peut trouver une courte pr&eacute;sentation du projet et de ce
qui a d&eacute;j&agrave; &eacute;t&eacute; fait dans <a
 href="http://pcfengine.enstb.org">http://pcfengine.enstb.org</a> et <a
 href="http://www.lit.enstb.org/%7Ekeryell/projets/PCFengine/expose/2002-09-12/"><tt>http://www.lit.enstb.org/~keryell/projets/PCFengine/expose/2002-09-12/</tt></a>
</p>
<p>Les points &agrave; d&eacute;velopper dans ce projet sont :
</p>
<ul>
  <li> mod&eacute;lisation ; </li>
  <li> classes motrice de PCFengine ; </li>
  <li> nouvelles actions ; </li>
  <li> am&eacute;liorations d'anciennes actions de Cfengine ; </li>
  <li> point fixe ; </li>
  <li> &eacute;crire un compilateur de Cfengine vers PCFengine et
&eacute;ventuellement
r&eacute;ciproquement ; </li>
  <li> regarder la portabilit&eacute; sur Unix et NT. </li>
</ul>
<p>
Contact : <a href="http://www-info.enst-bretagne.fr/%7Ekeryell">Ronan
Keryell - 02 98 00 14 15</a> - <a
 href="mailto:Ronan.Keryell@enst-bretagne.fr">Ronan.Keryell@enst-bretagne.fr</a>
</p>
<hr><code>
$Header: /users/lit/keryell/ENST-Bretagne/3A/DEA/2005-2006/Sujets/RCS/PCFengine.html,v 1.9 2005/10/10 21:09:47 keryell Exp $
</code>
</body>
</html>
